### Heroes Of Pymoli Data Analysis
* Of the 1163 active players, the vast majority are male (84%). There also exists, a smaller, but notable proportion of female players (14%).

* Our peak age demographic falls between 20-24 (44.8%) with secondary groups falling between 15-19 (18.60%) and 25-29 (13.4%).  
-----

pwd

In [69]:
# Dependencies and Setup
import pandas as pd

# File to Load (Remember to Change These)
file_to_load = "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
purchase_data = pd.read_csv(file_to_load)

purchase_data

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44
...,...,...,...,...,...,...,...
775,775,Aethedru70,21,Female,60,Wolf,3.54
776,776,Iral74,21,Male,164,Exiled Doomblade,1.63
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46
778,778,Sisur91,7,Male,92,Final Critic,4.19
779,779,Ennrian78,24,Male,50,Dawn,4.60

## Player Count

* Display the total number of players

In [70]:
# Find the total number of unique players
players_count = purchase_data["SN"].value_counts()
players_count

Lisosia93      5
Iral74         4
Idastidru52    4
Idai61         3
Aelin32        3
              ..
Sisur91        1
Iadueria43     1
Chadossa56     1
Aela59         1
Aidaira26      1
Name: SN, Length: 576, dtype: int64

In [71]:
sum_players_count = players_count.count()
sum_players_count

576

In [72]:
# Create a data frame with new column called 'Total Number of Players' 
total_players_count = {
    "Total number of players": [sum_players_count]
}

total_players_count_df = pd.DataFrame(total_players_count)
total_players_count_df

   Total number of players
0                      576

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [73]:
# Find the number of unique items
# .unique() to find the unique variables
# .len() to count the number of unique
purchasing_analysis_item = purchase_data["Item Name"].value_counts()
purchasing_analysis_unique_total = purchasing_analysis_item.count()
purchasing_analysis_unique_total

179

In [74]:
# Find the number of average price 
purchasing_analysis_price = purchase_data["Price"].mean()
purchasing_analysis_price

3.050987179487176

In [75]:
# Find the total number of purchases
purchasing_analysis_item_total = purchasing_analysis_item.sum()
purchasing_analysis_item_total

780

In [76]:
# Find the total revenue
purchasing_analysis_price_total = purchase_data["Price"].sum()
purchasing_analysis_price_total

2379.77

In [77]:
# Create dataframe including num. of unique items, num. of average price, total num of purchases, total revenue 
purchasing_analysis_df = {
    "Number of unique item": [purchasing_analysis_unique_total],
    "Number of average price": [purchasing_analysis_price],
    "Total number of purchases": [purchasing_analysis_item_total],
    "Total revenue": [purchasing_analysis_price_total]
}

purchasing_analysis_df = pd.DataFrame(purchasing_analysis_df)
purchasing_analysis_df

,Number of unique item,Number of average price,Total number of purchases,Total revenue
0,179,3.050987,780,2379.77

In [78]:
# # Format the data to be more readable
# purchasing_analysis_format_dict = {"Number of average price":"${0:,.2f}", "Total revenue" : "${0:,.2f}"}
# purchasing_analysis_df.style.format(purchasing_analysis_format_dict)

## Gender Demographics

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

In [79]:
# Clean dataset by dropping duplicate with df.drop_duplicates(subset=['brand'])
cleaned_purchase_data = purchase_data.drop_duplicates(subset=['SN'])
cleaned_purchase_data

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44
...,...,...,...,...,...,...,...
773,773,Hala31,21,Male,19,"Pursuit, Cudgel of Necromancy",1.02
774,774,Jiskjask80,11,Male,92,Final Critic,4.19
775,775,Aethedru70,21,Female,60,Wolf,3.54
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46
778,778,Sisur91,7,Male,92,Final Critic,4.19

In [80]:
# Find the number of males, females, and others
counts_gender_data = cleaned_purchase_data["Gender"].value_counts()
counts_gender_data

Male                     484
Female                    81
Other / Non-Disclosed     11
Name: Gender, dtype: int64

In [81]:
# Find the % for each gender using variable / sum_players_count
percentage_of_players = counts_gender_data / sum_players_count
percentage_of_players

Male                     0.840278
Female                   0.140625
Other / Non-Disclosed    0.019097
Name: Gender, dtype: float64

In [82]:
# Create a dataframe including total counts and % for each male, female, and other(s)
percentage_gender_data_df = {
    "Total Count": counts_gender_data,
    "Percentage of Players": percentage_of_players
}
percentage_gender_data_df = pd.DataFrame(percentage_gender_data_df)
percentage_gender_data_df

                       Total Count  Percentage of Players
Male                           484               0.840278
Female                          81               0.140625
Other / Non-Disclosed           11               0.019097

In [83]:
# # Format the data to be more readable
# percentage_gender_format = {"Percentage of Players": "{:.2%}"}
# percentage_gender_data_df.style.format(percentage_gender_format)


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Addtional preview: the displayed data cleaner formatting


* Display the summary data frame

In [84]:
# Filter all information by gender using df.groupby(['Animal']).count()
gender_data = purchase_data.groupby(['Gender'])
gender_data

In [85]:
gender_data = gender_data.count()
gender_data

                       Purchase ID   SN  Age  Item ID  Item Name  Price
Gender
Female                         113  113  113      113        113    113
Male                           652  652  652      652        652    652
Other / Non-Disclosed           15   15   15       15         15     15

In [86]:
# Obtain purchase count filtered by each gender
purchasecount_gender_data = gender_data ['Purchase ID']
purchasecount_gender_data

Gender
Female                   113
Male                     652
Other / Non-Disclosed     15
Name: Purchase ID, dtype: int64

In [87]:
# Find avg. purchase price by gender using df.groupby(['Animal']).mean()
avg_gender_data = purchase_data.groupby(['Gender']).mean()
# Obtain avg. purchase price by gender
avgprice_gender_data = avg_gender_data['Price']
avgprice_gender_data

Gender
Female                   3.203009
Male                     3.017853
Other / Non-Disclosed    3.346000
Name: Price, dtype: float64

In [88]:
# Find total purchase value by gender using df.groupby(['Animal']).sum()
total_gender_data = purchase_data.groupby(['Gender']).sum()
#obtain avg. purchase price by gender
totalpurchase_gender_data = total_gender_data['Price']
totalpurchase_gender_data

Gender
Female                    361.94
Male                     1967.64
Other / Non-Disclosed      50.19
Name: Price, dtype: float64

In [89]:
# Find avg. purchase total per person by gender = total purchase value (by gender) / number of ppl (by gender)
avgpurchase_gender_data = totalpurchase_gender_data / counts_gender_data
avgpurchase_gender_data

Female                   4.468395
Male                     4.065372
Other / Non-Disclosed    4.562727
dtype: float64

In [90]:
#create df 
purchase_analysis_gender_df = {
    "Purchase Count": purchasecount_gender_data,
    "Avg. Purchase Price": avgprice_gender_data,
    "Total Purchase Value": totalpurchase_gender_data,
    "Avg. Purchase Total per Person": avgpurchase_gender_data
}

purchase_analysis_gender_df = pd.DataFrame(purchase_analysis_gender_df)
purchase_analysis_gender_df

,Purchase Count,Avg. Purchase Price,Total Purchase Value,Avg. Purchase Total per Person
Gender,,,,
Female,113,3.203009,361.94,4.468395
Male,652,3.017853,1967.64,4.065372
Other / Non-Disclosed,15,3.346000,50.19,4.562727

In [91]:
# # Format the data to be more readable
# purchase_analysis_gender_format = {"Avg. Purchase Price":"${0:,.2f}", "Total Purchase Value" : "${0:,.2f}", "Avg. Purchase Total per Person" : "${0:,.2f}"}
# purchase_analysis_gender_df.style.format(purchase_analysis_gender_format)

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

In [92]:
cleaned_purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [93]:
# create bins 
bins_by_ages = [0, 9, 14, 19, 24, 29, 34, 39, 45]

# Create the names for the bins
bin_labels_by_ages = ["<10", "10 - 14", "15 - 19", "20 - 24", "25 - 29", "30 - 34", "35 - 39", "40+"]

assert len(bins_by_ages) == len(bin_labels_by_ages) + 1

In [94]:
#create df for existing players use pd.cut()
cleaned_purchase_data["Demographics"] = pd.cut(
    x= cleaned_purchase_data["Age"], 
    bins= bins_by_ages, 
    labels= bin_labels_by_ages, 
    include_lowest= True   # Whether to be left inclusive
)
cleaned_purchase_data

<ipython-input-94-4e69d80b6611>:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  cleaned_purchase_data["Demographics"] = pd.cut(

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Demographics
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20 - 24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20 - 24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20 - 24
4,4,Iskosia90,23,Male,131,Fury,1.44,20 - 24
...,...,...,...,...,...,...,...,...
773,773,Hala31,21,Male,19,"Pursuit, Cudgel of Necromancy",1.02,20 - 24
774,774,Jiskjask80,11,Male,92,Final Critic,4.19,10 - 14
775,775,Aethedru70,21,Female,60,Wolf,3.54,20 - 24
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46,20 - 24
778,778,Sisur91,7,Male,92,Final Critic,4.19,<10

In [95]:
#make new variable to pull data for isolation
total_count = cleaned_purchase_data.groupby("Demographics")["Age"].count()
total_count

Demographics
<10         17
10 - 14     22
15 - 19    107
20 - 24    258
25 - 29     77
30 - 34     52
35 - 39     31
40+         12
Name: Age, dtype: int64

In [96]:
# Create a new column for Percentage of Players
players_pct = (total_count / sum(total_count)) * 100
players_pct

Demographics
<10         2.951389
10 - 14     3.819444
15 - 19    18.576389
20 - 24    44.791667
25 - 29    13.368056
30 - 34     9.027778
35 - 39     5.381944
40+         2.083333
Name: Age, dtype: float64

In [97]:
# create a summary table for age demographics
age_demographic_df = pd.concat([total_count, players_pct], axis=1)
age_demographic_df

              Age        Age
Demographics
<10            17   2.951389
10 - 14        22   3.819444
15 - 19       107  18.576389
20 - 24       258  44.791667
25 - 29        77  13.368056
30 - 34        52   9.027778
35 - 39        31   5.381944
40+            12   2.083333

In [98]:
# When encountering identical strings for the columns, create new column names accordingly:
identical_keys = {'Age': ['Total Count', 'Percentage of Players']}
final_age_demographic_df = age_demographic_df.rename(columns=lambda c: identical_keys[c].pop(0) if c in identical_keys.keys() else c)
final_age_demographic_df

              Total Count  Percentage of Players
Demographics
<10                    17               2.951389
10 - 14                22               3.819444
15 - 19               107              18.576389
20 - 24               258              44.791667
25 - 29                77              13.368056
30 - 34                52               9.027778
35 - 39                31               5.381944
40+                    12               2.083333

In [99]:
# # Format the data to be more readable
# age_demographic_format = {"Percentage of Players": "{:.2%}"}
# final_age_demographic_df.style.format(age_demographic_format)

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Display the summary data frame

In [100]:
# create bins 
bins_by_ages = [0, 9, 14, 19, 24, 29, 34, 39, 45]

# Create the names for the bins
bin_labels_by_ages = ["<10", "10 - 14", "15 - 19", "20 - 24", "25 - 29", "30 - 34", "35 - 39", "40+"]

assert len(bins_by_ages) == len(bin_labels_by_ages) + 1

In [101]:
#create df for existing players use pd.cut()
purchase_data["Demographics"] = pd.cut(
    x= purchase_data["Age"], 
    bins= bins_by_ages, 
    labels= bin_labels_by_ages, 
    include_lowest= True   # Whether to be left inclusive
)
purchase_data

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Demographics
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20 - 24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20 - 24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20 - 24
4,4,Iskosia90,23,Male,131,Fury,1.44,20 - 24
...,...,...,...,...,...,...,...,...
775,775,Aethedru70,21,Female,60,Wolf,3.54,20 - 24
776,776,Iral74,21,Male,164,Exiled Doomblade,1.63,20 - 24
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46,20 - 24
778,778,Sisur91,7,Male,92,Final Critic,4.19,<10
779,779,Ennrian78,24,Male,50,Dawn,4.60,20 - 24

In [102]:
#make new variable to pull data for isolation
purchase_count = purchase_data.groupby("Demographics")["Age"].count()
purchase_count

Demographics
<10         23
10 - 14     28
15 - 19    136
20 - 24    365
25 - 29    101
30 - 34     73
35 - 39     41
40+         13
Name: Age, dtype: int64

In [103]:
# find total purchase value for each demographic (age)
total_purchase_value = purchase_data.groupby("Demographics")["Price"].sum()
total_purchase_value

Demographics
<10          77.13
10 - 14      82.78
15 - 19     412.89
20 - 24    1114.06
25 - 29     293.00
30 - 34     214.00
35 - 39     147.67
40+          38.24
Name: Price, dtype: float64

In [104]:
# find average purchase price by total_purchase_value / purchase_count
average_purchase_price = total_purchase_value / purchase_count
average_purchase_price

Demographics
<10        3.353478
10 - 14    2.956429
15 - 19    3.035956
20 - 24    3.052219
25 - 29    2.900990
30 - 34    2.931507
35 - 39    3.601707
40+        2.941538
dtype: float64

In [105]:
# average total purchase per person
total_purchase_person = cleaned_purchase_data.groupby("Demographics")["Price"].sum()
total_purchase_person

Demographics
<10         57.63
10 - 14     67.64
15 - 19    331.88
20 - 24    790.39
25 - 29    223.93
30 - 34    151.92
35 - 39    108.81
40+         36.45
Name: Price, dtype: float64

In [106]:
#make new variable to pull data for isolation
average_total_purchase_person = total_purchase_value / total_count 
average_total_purchase_person

Demographics
<10        4.537059
10 - 14    3.762727
15 - 19    3.858785
20 - 24    4.318062
25 - 29    3.805195
30 - 34    4.115385
35 - 39    4.763548
40+        3.186667
dtype: float64

In [107]:
# concat all columns 
purchase_analysis_df = pd.concat([purchase_count, average_purchase_price, total_purchase_value, average_total_purchase_person], axis=1)
purchase_analysis_df

              Age         0    Price         1
Demographics
<10            23  3.353478    77.13  4.537059
10 - 14        28  2.956429    82.78  3.762727
15 - 19       136  3.035956   412.89  3.858785
20 - 24       365  3.052219  1114.06  4.318062
25 - 29       101  2.900990   293.00  3.805195
30 - 34        73  2.931507   214.00  4.115385
35 - 39        41  3.601707   147.67  4.763548
40+            13  2.941538    38.24  3.186667

In [108]:
# rename columns using df.rename(columns={"A": "a", "B": "c"})
final_purchase_analysis_df = purchase_analysis_df.rename(columns={"Age":"Purchase Count", 0: "Avg Purchase Price", "Price": "Total Purchase Value", 1: "Avg Total Purchase per Person"})
final_purchase_analysis_df

,Purchase Count,Avg Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Demographics,,,,
<10,23,3.353478,77.13,4.537059
10 - 14,28,2.956429,82.78,3.762727
15 - 19,136,3.035956,412.89,3.858785
20 - 24,365,3.052219,1114.06,4.318062
25 - 29,101,2.900990,293.00,3.805195
30 - 34,73,2.931507,214.00,4.115385
35 - 39,41,3.601707,147.67,4.763548
40+,13,2.941538,38.24,3.186667

In [109]:
# # Format the data to be more readable
# purchase_analysis_format = {"Avg Purchase Price":"${0:,.2f}", "Total Purchase Value":"${0:,.2f}", "Avg Total Purchase per Person" :"${0:,.2f}"}
# final_purchase_analysis_df.style.format(purchase_analysis_format)

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Display a preview of the summary data frame

In [110]:
# Create a table for individual's total count, how many, and average 
indv_total_count = purchase_data["SN"].value_counts()
indv_total_count.sort_values(ascending=False).head()

Lisosia93      5
Iral74         4
Idastidru52    4
Ilarin91       3
Silaera56      3
Name: SN, dtype: int64

In [111]:
# Find total purchase value per individual
indv_total_purchase_value = purchase_data.groupby("SN")["Price"].sum()
indv_total_purchase_value.sort_values(ascending=False).head()

SN
Lisosia93      18.96
Idastidru52    15.45
Chamjask73     13.83
Iral74         13.62
Iskadarya95    13.10
Name: Price, dtype: float64

In [112]:
indv_avg_total_purchase_value = indv_total_purchase_value / indv_total_count
indv_avg_total_purchase_value.sort_values(ascending=False).head()

Dyally87          4.99
Chanirrasta87     4.94
Yarithsurgue62    4.94
Ririp86           4.94
Lirtilsa71        4.94
dtype: float64

In [113]:
# Create dataframe for top spenders
top_spenders_df = pd.concat([indv_total_count, indv_avg_total_purchase_value, indv_total_purchase_value], axis=1)
sort_top_spenders_df = top_spenders_df.sort_values("Price", ascending=False)
sort_top_spenders_df

             SN         0  Price
Lisosia93     5  3.792000  18.96
Idastidru52   4  3.862500  15.45
Chamjask73    3  4.610000  13.83
Iral74        4  3.405000  13.62
Iskadarya95   3  4.366667  13.10
...          ..       ...    ...
Ililsasya43   1  1.020000   1.02
Eudanu84      1  1.020000   1.02
Chanirra79    1  1.010000   1.01
Aidai61       1  1.010000   1.01
Alo38         1  1.000000   1.00

[576 rows x 3 columns]

In [114]:
# Top 5 spenders are the following:
final_top_spenders = sort_top_spenders_df.head(5)
final_top_spenders

             SN         0  Price
Lisosia93     5  3.792000  18.96
Idastidru52   4  3.862500  15.45
Chamjask73    3  4.610000  13.83
Iral74        4  3.405000  13.62
Iskadarya95   3  4.366667  13.10

In [115]:
# rename columns using df.rename(columns={"A": "a", "B": "c"})
final_sort_top_spenders_df = sort_top_spenders_df.rename(columns={"SN":"Purchase Count", 0: "Average Purchase Price", "Price": "Total Purchase Value"}).head()
final_sort_top_spenders_df

             Purchase Count  Average Purchase Price  Total Purchase Value
Lisosia93                 5                3.792000                 18.96
Idastidru52               4                3.862500                 15.45
Chamjask73                3                4.610000                 13.83
Iral74                    4                3.405000                 13.62
Iskadarya95               3                4.366667                 13.10

In [116]:
# # Format the data to be more readable
# top_spenders_format = {"Average Purchase Price":"${0:,.2f}", "Total Purchase Value":"${0:,.2f}"}
# final_sort_top_spenders_df.style.format(top_spenders_format)

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [117]:
# Create a table for individual's total count, how many, and average 
popular_items = purchase_data.groupby("Item ID")
popular_items

In [118]:
names_popular_items = purchase_data.groupby("Item ID")["Item Name"]

In [119]:
popular_items = purchase_data["Item ID"].value_counts()
popular_items.sort_values(ascending=False).head()

92     13
178    12
108     9
132     9
82      9
Name: Item ID, dtype: int64

In [120]:
total_popular_items = purchase_data.groupby("Item ID")["Price"].sum()
total_popular_items.sort_values(ascending=False).head()

Item ID
92     59.99
178    50.76
82     44.10
145    41.22
103    34.80
Name: Price, dtype: float64

In [121]:
avg_total_popular_items = total_popular_items / popular_items
avg_total_popular_items

0      1.2800
1      2.9425
2      2.4800
3      2.4900
4      1.7000
        ...
178    4.2300
179    4.4800
181    1.6600
182    4.0300
183    1.0900
Length: 179, dtype: float64

In [122]:
# Create dataframe for popular item
popular_items_df = pd.concat([popular_items, avg_total_popular_items, total_popular_items], axis=1)
popular_items_df

     Item ID       0  Price
0          4  1.2800   5.12
1          4  2.9425  11.77
2          6  2.4800  14.88
3          6  2.4900  14.94
4          5  1.7000   8.50
..       ...     ...    ...
178       12  4.2300  50.76
179        6  4.4800  26.88
181        5  1.6600   8.30
182        3  4.0300  12.09
183        3  1.0900   3.27

[179 rows x 3 columns]

In [123]:
# Sort the data to ascending order to see the most popular items
ascending_popular_items_df = popular_items_df.sort_values("Item ID", ascending=False)
ascending_popular_items_df

     Item ID         0  Price
92        13  4.614615  59.99
178       12  4.230000  50.76
145        9  4.580000  41.22
132        9  3.221111  28.99
108        9  3.530000  31.77
..       ...       ...    ...
42         1  1.750000   1.75
51         1  4.660000   4.66
118        1  2.170000   2.17
104        1  1.930000   1.93
91         1  4.170000   4.17

[179 rows x 3 columns]

In [124]:
# Top 5 items are the following:
sort_popular_items = ascending_popular_items_df.head(5)
sort_popular_items

     Item ID         0  Price
92        13  4.614615  59.99
178       12  4.230000  50.76
145        9  4.580000  41.22
132        9  3.221111  28.99
108        9  3.530000  31.77

In [125]:
# rename columns using df.rename(columns={"A": "a", "B": "c"})
final_popular_items_df = sort_popular_items.rename(columns={"Item ID":"Purchase Count", 0: "Item Price", "Price": "Total Purchase Value"})
final_popular_items_df

     Purchase Count  Item Price  Total Purchase Value
92               13    4.614615                 59.99
178              12    4.230000                 50.76
145               9    4.580000                 41.22
132               9    3.221111                 28.99
108               9    3.530000                 31.77

In [126]:
# # Format the data to be more readable
# popular_items_format = {"Item Price":"${0:,.2f}", "Total Purchase Value":"${0:,.2f}"}
# final_popular_items_df.style.format(popular_items_format)

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame

In [127]:
# Create a table for individual's total count, how many, and average 
profitable_items = purchase_data.groupby("Item ID")
profitable_items

In [128]:
names_profitable_items = purchase_data.groupby("Item ID")["Item Name"]

In [129]:
profitable_items = purchase_data["Item ID"].value_counts()
profitable_items.sort_values(ascending=False).head()

92     13
178    12
108     9
132     9
82      9
Name: Item ID, dtype: int64

In [130]:
total_profitable_items = purchase_data.groupby("Item ID")["Price"].sum()
total_profitable_items.sort_values(ascending=False).head()

Item ID
92     59.99
178    50.76
82     44.10
145    41.22
103    34.80
Name: Price, dtype: float64

In [131]:
avg_total_profitable_items = total_popular_items / popular_items
avg_total_profitable_items

0      1.2800
1      2.9425
2      2.4800
3      2.4900
4      1.7000
        ...
178    4.2300
179    4.4800
181    1.6600
182    4.0300
183    1.0900
Length: 179, dtype: float64

In [132]:
# Create dataframe for popular item
profitable_items_df = pd.concat([popular_items, avg_total_popular_items, total_popular_items], axis=1)
profitable_items_df

     Item ID       0  Price
0          4  1.2800   5.12
1          4  2.9425  11.77
2          6  2.4800  14.88
3          6  2.4900  14.94
4          5  1.7000   8.50
..       ...     ...    ...
178       12  4.2300  50.76
179        6  4.4800  26.88
181        5  1.6600   8.30
182        3  4.0300  12.09
183        3  1.0900   3.27

[179 rows x 3 columns]

In [133]:
# Sort the list to see the most profitable items in the list
ascending_profitable_items_df = popular_items_df.sort_values("Price", ascending=False)
ascending_profitable_items_df

     Item ID         0  Price
92        13  4.614615  59.99
178       12  4.230000  50.76
82         9  4.900000  44.10
145        9  4.580000  41.22
103        8  4.350000  34.80
..       ...       ...    ...
28         2  1.060000   2.12
125        2  1.000000   2.00
126        1  2.000000   2.00
104        1  1.930000   1.93
42         1  1.750000   1.75

[179 rows x 3 columns]

In [134]:
# Top 5 profitable items are the following:
top_profitable_items = ascending_profitable_items_df.head(5)
top_profitable_items

     Item ID         0  Price
92        13  4.614615  59.99
178       12  4.230000  50.76
82         9  4.900000  44.10
145        9  4.580000  41.22
103        8  4.350000  34.80

In [135]:
# rename columns using df.rename(columns={"A": "a", "B": "c"})
final_profitable_items_df = top_profitable_items.rename(columns={"Item ID":"Purchase Count", 0: "Item Price", "Price": "Total Purchase Value"})
final_profitable_items_df

     Purchase Count  Item Price  Total Purchase Value
92               13    4.614615                 59.99
178              12    4.230000                 50.76
82                9    4.900000                 44.10
145               9    4.580000                 41.22
103               8    4.350000                 34.80

In [136]:
# # Format the data to be more readable
# profitable_items_format = {"Item Price":"${0:,.2f}", "Total Purchase Value":"${0:,.2f}"}
# final_profitable_items_df.style.format(profitable_items_format)